app/controllers/posts_controller.rb

  def show
    if params[:author_id]
      @post = Author.find(params[:author_id]).posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    # @post = Post.find(params[:id]) # allows anyone to edit an author's posts
    if params[:author_id]
      author = Author.find_by(id: params[:author_id])
      if author.nil?
        redirect_to authors_path, alert: "Author not found"
      else
        @post = author.posts.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]